#define _CRT_SECURE_NO_WARNINGS 1

#include<stdio.h>

//int check_sys()
//{
//	int a = 1;
//	//char* p = (char*)&a;
//	//return *p;
//	//简化版
//	return *(char*)&a;
//
//}
//
//
//
//int main(void)
//{
//	//写一段代码告诉我们当前机器的字节序是什么
//	
//	int ret = check_sys();
//	if (ret == 1)
//	{
//		printf("小端\n");
//	}
//	else
//	{
//		printf("大端\n");
//	}
//
//	return 0;
//
//}


//int main(void)
//{
//	char a = -1;
//	//10000000000000000000000000000001 源码
//	//11111111111111111111111111111110 反码
//	//11111111111111111111111111111111 补码
//	signed char b = -1;
//	//11111111111111111111111111111111
//	unsigned char c = -1;
//	//00000000000000000000000011111111 补码
//	//= 255
//	printf("a = %d, b = %d, c = %d\n", a, b, c);
//
//	return 0;
//}


//int main(void)
//{
//	char a = -128;
//	//10000000000000000000000001000000
//	//11111111111111111111111110111111
//	//11111111111111111111111111000000
//	
//	//整型提升负数补1
//	//11111111111111111111111111000000
//
//	
//	printf("%u\n", a);
//
//	return 0;
//}


int main(void)
{
	char a = 128;
	//因为是unsigned 类型  所以128 = 127 +1 = -128  
	//结果和上题一样
	printf("%u\n", a);

	return 0;
}